#include "uart.h"

void main(void)
{
 /*
 初始化串口
 */
 while(1)
  {
   	push(0,1);//向第一通道缓冲区填充数据1
   	push(1,2);//向第一通道缓冲区填充数据2
	push(2,3);//向第一通道缓冲区填充数据3
	push(3,4);//向第一通道缓冲区填充数据4
	push(4,5);//向第一通道缓冲区填充数据5
	push(5,6);//向第一通道缓冲区填充数据6
        //.....填充更多通道，不填充默认是0
        uSendOnePage();//发送一帧数据
        delayms(50);   //延时，不要发送太快了
  }
}

//FB 6D 25 00 01 00 02 00 03 00 04 00 05 00 06 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 35 
//FF 55 AA 10 00 01 00 02 00 03 00 04 00 05 00 06 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 35 






